Autodesk.Revit.DB.Structure.RebarSpliceByRulesError
Class that defines states for splicing a Rebar by rules.

Autodesk.Revit.DB.Structure.RebarSpliceByRulesError.InvalidCombinationOfMaximumMinimumBarLengthAndLapLength
The combination of the maximum bar length, minimum bar length and lap length is invalid.

Autodesk.Revit.DB.Structure.RebarSpliceByRulesError.LapLengthBiggerThanMaximumBarLength
The lap length is greater than the maximum length.

Autodesk.Revit.DB.Structure.RebarSpliceByRulesError.CantSpliceAllTheBarsInSet
Some bars in the varying set are not intersected by the resulting splice geometries.

Autodesk.Revit.DB.Structure.RebarSpliceByRulesError.TooBigArc
The arc segment exceeds the maximum length.

Autodesk.Revit.DB.Structure.RebarSpliceByRulesError.MaximumLengthBiggerThanBarLength
The maximum length exceeds the bar length.

Autodesk.Revit.DB.Structure.RebarSpliceByRulesError.TooSmallRunOut
The run-out is below minimum length, or the lap can't be applied to it.

Autodesk.Revit.DB.Structure.RebarSpliceByRulesError.TooBigHook
The hook lengths exceed the maximum length.

Autodesk.Revit.DB.Structure.RebarSpliceByRulesError.InvalidRebar
Free Form rebars, or Shape Driven rebars that are Multiplanar, or have a shape that whose definition is RebarShapeDefinitionByArc, or rebars that are part of a group can't be spliced.

Autodesk.Revit.DB.Structure.RebarSpliceByRulesError.Unknown
There is an unexpected error.

Autodesk.Revit.DB.Structure.RebarSpliceByRulesError.Success
Splice by rules can be successfully done.